/*********************************************************************************************************
* 模块名称：Filter.h
* 摘    要：Filter模块
* 当前版本：1.0.0
* 作    者：
* 完成日期：
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/
#ifndef _FILTER_H_
#define _FILTER_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
typedef struct{
  //滤波器系数
  float b0, b1, b2;
  float a0, a1, a2;
  
  //状态变量
  float x_perv[3];  //x[n-1],x[n-2]
  float y_perv[3];  //y[n-1],y[n-2]
}Filter;

//移动平均滤波器结构体
typedef struct{
  float *buffer;     //数据缓冲区
  float sum;         //窗口数据和
  u16 window_size; //窗口大小
  u16 index;       //当前写入位置
  u8 filled;       //缓冲区已满标志
}MovingAverageFilter;
/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void FilterInit(void);                                                       //初始化Filter模块
void NotchFilterInit(Filter *filter, float f0, float Q, float fs);           //初始化陷波器
void HighPassFilterInit(Filter *filter, float fc, float fs, float Q);        //初始化高通滤波器
void LowPassFilterInit(Filter *filter, float fc, float fs);                  //初始化低通滤波器-IIR
void BandPassFilterInit(Filter *filter, float flow, float fhigh, float fs);  //初始化带通滤波器
float  FilterPro(Filter *filter, float input);                                   //处理单个采样点
void MovingAverage_Init(MovingAverageFilter *filter, float *buffer, u16 window_size);  //初始化移动平均滤波器
float  MovingAverageFilter_Pro(MovingAverageFilter *filter,float input);         //平滑滤波

#endif
